# Created 2025-07-23 Wed 21:59
#+options: broken-links:nil toc:nil ':t ":t prop:nil
#+title: 2025 Algebra 2
#+author: Anand Deopurkar
#+filetags: teaching
#+property: header-args:sage :eval no-export
#+bind: org-html-postamble nil
#+bind: org-html-preamble nil
#+export_file_name: ~/website/content/teaching/2025_algebra2/index.org
#+exclude_tags: solution solutions noexport
*** Workshop 6
The goal of this workshop is to see the connection between field automorphisms and algebraic relations satisfied by the roots as alluded in the lecture.

Let \(\alpha_1, \dots, \alpha_4\) be the roots of \(x^4-2 = 0\).
Let \(K = \mathbf{Q}[\alpha_1, \dots, \alpha_4] \subset \mathbf{C}\).

1. Prove that any automorphism of \(K\) must permute the \(\alpha_i\).

2. Using the above, conclude that we have an injective map \(\operatorname{Aut}(K) \to S_4\).

3. What is the image of this map?  That is, which permutations of the roots arise from automorphisms of the field?

   The answer is closely tied to /polynomial relations among the roots/.
   Suppose
   \[\alpha_1 = 2^{1/4}, \quad \alpha_2 = 2^{1/4} i, \quad \alpha_3 = -2^{1/4}, \quad \alpha_4 = -2^{1/4}i.\]
   Observe that we have the relation \(\alpha_1 + \alpha_3 = 0\) but not the relation \(\alpha_1 + \alpha_{4} = 0\).
   Conclude that the polynomial \((34)\) cannot be in the image of \(\operatorname{Aut}(K)\).

4. Let us find all possible polynomial relations in the roots.
   This is simply the kernel of the map
   \[ \mathbf{Q}[x_1, \dots, x_4] \to K\]
   that sends \(x_i\) to \(\alpha_i\).
   Let us ask the computer to find it:
   #+begin_src sage :exports both
     K = QQ[i+2^(1/4)]
     S.<x1,x2,x3,x4> = PolynomialRing(QQ,4)
     f = S.hom([2^(1/4), i*2^(1/4), -2^(1/4), -i*2^(1/4)],K)
     f.kernel()
   #+end_src

   #+results: 
   : Ideal (x2 + x4, x1 + x3, x3^2 + x4^2, x4^4 - 2)

   Now that you know the kernel, rule out some other permutations.

5. It is more efficient to find \(\operatorname{Aut} K\) using another presentation.
   We have the presentation \(\mathbf{Q}[x,y]/(x^2+1, y^4-2) \to K\) given by \(x \mapsto i\) and \(y \mapsto 2^{1/4}\).
   (Assume for now that this map is an isomorphism, and later convince yourselves that this is indeed the case).
   Use this presentation to conclude that \(\operatorname{Aut} K\) has 8 elements.
   Describe them by how they act on \(i\) and \(2^{1/4}\).
   Use this description to pin down the 8 permutations of \(\alpha_1, \dots, \alpha_{4}\) arising from \(\operatorname{Aut} K\).
*** Workshop 7
1. Find the degrees of the splitting fields of:
   1. \(x^3-2\) over \(\mathbf{Q}\)
   2. \(x^3-t\) over \(\mathbf{C}(t)\)

2. In all the examples above, let \(K/F\) be the splitting field.
   Find a nice presentation of \(K\) over \(F\).
   (That is, write \(K = F[x_1, \dots, x_n] / I\) for an explicit ideal \(I\).)

3. We can express any symmetric expression in the roots in terms of the coefficients, which allows us to find its precise value.
   For an asymmetric expression, we can find the value up to a finite ambiguity.
   Here is an example.
   Let \(\alpha_1, \alpha_2, \alpha_3\) be the roots of \(f(x) = x^3+2x-2\), and let \(\alpha = \alpha_1\alpha_2-\alpha_3\).
   The \(S_3\) orbit of the expression \(x_1x_2-x_3\) contains 2 other expressions: \(x_1x_3-x_2\) and \(x_2x_3-x_1\).
   Let \(\beta = \alpha_1\alpha_3 - \alpha_2\) and \(\gamma = \alpha_2\alpha_3-\alpha_1\).

   1. Prove that \((x-\alpha)(x-\beta)(x-\gamma)\) has coefficients in \(\mathbf{Q}\).
   2. Find these coefficients.  You have then narrowed down \(\alpha\) to 3 possible values.

      To do this, you will have to rewrite symmetric polynomials in terms of elementary symmetric polynomials.  Here is an example of how to do that in ~sage~.
      Remember that you can copy/paste and evaluate sage code at https://sagecell.sagemath.org/.
      #+begin_src sage :exports both
        S.<x,y,z> = PolynomialRing(QQ, 3)
        E = SymmetricFunctions(QQ).elementary()
        E.from_polynomial((x*y-z)*(x*z-y)*(y*z-x))  #Modify for your polynomial.
      #+end_src

      #+results: 
      : e[2, 2] - e[3] - 2*e[3, 1] - e[3, 1, 1] + 2*e[3, 2] + e[3, 3] +
      : 2*e[4] + e[4, 1] - 2*e[4, 2] - 5*e[5] + 2*e[5, 1] - 2*e[6]


      Explanation of notation:
      - \(e[i]\) is the \(i\)-th elementary symmetric polynomial \(e_i\).
      - \(e[i,j]\) is \(e_i \cdot e_j\), and so on.
      - Since we only have 3 variables, \(e_{4}\) and above are zero.
        So, the expression ~sage~ gave reduces to
        \[e_2^2 - e_3 - 2 e_3e_1 + e_3e_1^2 +  2 e_3e_2 + e_3^2.\]

      You don't have to use ~sage~.  Feel free to use whatever method (including computation by hand).  And, of course, I do not expect you to do this kind of heavy computation on an exam.
